# Preset Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
PresetInitialColor..::..Preset Property
PresetInitialColor Class See Also
---
The preset value
**Namespace:** Autodesk.Revit.DB.Lighting**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public ColorPreset Preset { get; set; }
```

Visual Basic
---
```text
Public Property Preset As ColorPreset
	Get
	Set
```

Visual C++
---
```text
public:
property ColorPreset Preset {
	ColorPreset get ();
	void set (ColorPreset value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | When setting this property: A value passed for an enumeration argument is not a member of that enumeration |

# See Also
PresetInitialColor Class
Autodesk.Revit.DB.Lighting Namespace